[
  {
    "id": "1",
    "title": "Bluebid",
    "image": "/assets/bluebid-home.png",
    "imageCaption": "The home page of Bluebid.",
    "description": "Bluebid is a bidding website to make bids on items. It allows users to register and log in as a user, create auction listings, and bid on items using a credit-based system.",
    "bigDescription": "Bluebid is a bidding website to make bids on items. The website allows users to register, create auction listings, and bid on items using a credit-based system. The application communicates with an existing API to handle auction-related data.",
    "features": "Users with a stud.noroff.no email address can register for the platform, and securely log in and out of their accounts. They can update their avatar to personalize their profile. New users start with 1000 credits, and credits can be earned by selling items and spent by bidding on or purchasing items. Users can add a title, deadline, description, and media gallery for an auction. Users can also place bids on other users' active listings, and see the bids placed on a specific listing. Unregistered users can search for listings, browse and search through available auction listings without registering.",
    "reflectionsAndImprovements":"This project was a learning process, with many new features I had not implemented before. It helped me learn more and it challenged me. If I had more time, I would spend more time adding more user friendly visuals, like toast notifications, better loading visibility and more detailed error messages. It could also benefit from adding unit tests. It could also be improved by adding TypeScript for a better developer experience and stronger type-safety. After reviewing the project again, I have added some improvements by including more formdata validation.",
    "link": "https://bluebid.netlify.app",
    "repositoryLink":"https://github.com/TheRegzi/bluebid"
  },
  {
    "id": "2",
    "title": "Next Level Goods",
    "image": "/assets/nlg-screenshot.jpg",
    "imageCaption": "The home page of Next Level Goods.",
    "description": "Next Level Goods is an online store made with React that allows users to register and log in, browse and search for items, add items to the cart and proceed to checkout.",
    "bigDescription":"Next Level Goods is an online store created with React and TypeScript that allows users to register and log in, browse and search for items, add items to the cart and proceed to checkout. The home page displays product cards in a grid, so that the user can view important aspects of the products; image, name, short description, price, price on sale, rating and a link to the specific product page.",
    "features":"It includes a responsive navigation bar which features a hamburger menu for mobile screens and a shopping cart icon that dynamically updates the cart item count based on localStorage data. It listens for a custom event (cartUpdated) to dynamically update the cart count. When going to shopping cart, the users get to view the products added to the cart and the calculated total of the products. It uses styled-components for styling.",
    "reflectionsAndImprovements":"When looking back at my code now and if I had more time, I would add JS docs to properly document my code. I would use prettier, eslint and husky to format my code, so that all code is neatly formatted and organized, and make sure there are no unnecessary spaces in the code, which is important. I would also make sure there are no unused variables in the code. I would remove all console.logs and make sure that all errors are visible and clear for the users, by focusing on detailed and visible errors and implement toast notifications. By now, I have already made some improvements on the project code, and I have added eslint, prettier and husky.",
    "link": "https://nextlevelgoods.netlify.app",
    "repositoryLink":"https://github.com/TheRegzi/react-course-assignment"
  },
  {
    "id": "3",
    "title": "Holidaze",
    "image": "/assets/holidaze-app.jpg",
    "imageCaption": "The home page of Holidaze.",
    "description": "Holidaze is a holiday booking website created with React. It is for viewing, booking and creating holiday venues. Two roles to register as; Regular customer and Venue manager.",
    "bigDescription":"Holidaze is a holiday booking website created with React, which was the final project exam at my Front-end Development studies at Noroff. It is for viewing, booking and creating holiday venues. The application communicates with an existing API to handle the venue data. There are two roles to register as; Regular customer and Venue manager.",
    "features": "All users can view a list of newest venues, and search for venues by location, dates to be booked and number of guests. All users can view a specific venue by ID, and see the available dates marked on a calendar. Registration: Users with a 'stud.noroff.no' email address can register for the platform; either as a Customer or a Venue manager. For Regular Customers: Can create bookings at other venues made by venue managers. View their upcoming bookings on their profile page. Edit their profile by updating their avatar image and banner image. Login and Logout: Users can securely log in and out of their accounts. For Venue Managers: Create their own venues. Can update and delete a venue they manage. Can view upcoming bookings at a venue they manage in a table on the specific venue page. Edit their profile by updating their avatar image and banner image. View a list of both their own venues and upcoming bookings on the profile page.",
    "reflectionsAndImprovements": "This was a large and challenging project that pushed me to grow as a frontend developer. One of the most demanding parts was managing both user roles: regular customer and venue manager. This was something I had never done before, but it turned out to be a valuable learning experience that taught me a lot about user flow, conditional rendering, and data handling. I was highly focused on delivering a high-quality result and everything from layout, responsiveness, and functionality was carefully fine-tuned to ensure a good user experience. If I had more time, I would expand the site further by adding more pages such as About and Contact. I also see potential in improving the user functionality – for example, allowing users to search for other users and view their profiles. I would also use TypeScript instead of vanilla JavaScript. Because I prioritized doing the most essential features well, I didn't have much time to add other features. Still, I'm proud of what I accomplished and how much I learned throughout the process.",
    "link": "https://holidaze25.netlify.app",
    "repositoryLink":"https://github.com/TheRegzi/holidaze"
  },
  {
    "id": "4",
    "title": "Weather Wise",
    "image": "/assets/weater-wise.png",
    "imageCaption": "The home page of Weather Wise.",
    "description": "Weather wise is a weather app created with Next.js. It is for viewing the weather and searching for places to see the weather forecast for 10 days ahead.",
    "bigDescription":"Weather wise is a weather app I made on my own by using Next.js and Tailwind CSS. It uses a free API from Open Meteo, so you can search for all the places you want and get different search results, that takes you to the specific weather page when clicking on a link. It displays the forecasted weather of ten days for each specific weather page.",
    "features": "All users can view and search for places to see the weather forecast for 10 days ahead. It has a responsive design, so it works well on both desktop and mobile devices. It uses Next.js for server-side rendering and Tailwind CSS for styling.",
    "reflectionsAndImprovements": "I had never used Next.js before, so this was a great learning experience for me. I learned how to use it and it got easier and easier, as it is quite similar to React. There are also many new aspects to think about when forecasting weather, like the different units of measurement for temperature, wind speed, and precipitation. The app can be further improved by adding more features like a favorites list, so you can save your favorite places to easily access them later. It can also be improved by adding more detailed weather information, like humidity and UV index, and add a map over a specific place.",
    "link": "https://weather-wise-sigma-one.vercel.app",
    "repositoryLink":"https://github.com/TheRegzi/weather-wise"
  },
    {
    "id": "5",
    "title": "Community Science Museum",
    "image": "/assets/csm-home.jpg",
    "imageCaption": "The home page of Community Science Museum.",
    "description": "Community Science Museum was one of my first projects at my front end studies. It is for viewing and reading about the museum, making families excited to visit it.",
    "bigDescription":"This project aims to design and develop a modern, accessible, and responsive web presence for an interactive museum called the Community Science Museum. The target audience is primary and middle school children and families. The main goal is to excite people enough to come visit the museum. The theme should not be too childish, but still appeal to children.",
    "features": "It features an Explore page which appeals to kids, teachers and researchers. Exhibition Spaces gives information about the current exhibitions at the museum. Special Events is about which events are coming soon. Additional pages are Visit and Get involved, which aims to make people come visit and contribute.",
    "reflectionsAndImprovements": "As it was one of my first projects at my front end studies, I learned a lot about HTML and CSS. I also learned how to use Figma to design the website before coding it. The website could by improved by adding more images and animations, making it a more modern design.",
    "link": "https://theregzi.github.io/Semester-Project-1/",
    "repositoryLink":"https://github.com/TheRegzi/Semester-Project-1"
  }
]